app/views/users/index.html.erb

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 6]]
---
                                <%= link_to user do %>
                                    <h2><%= user.profile.first_name %> <%=user.profile.last_name %></h2>